# College Sports Expenses, Revenue, and Coaching Staff

In [1]:
# Packages used
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import pymysql as mysql
import sqlalchemy 
from prometheus_client import start_http_server, Gauge
import time
import logging

import warnings
warnings.filterwarnings('ignore')

## Monitoring and logging

In [2]:
# Configure logging
logging.basicConfig(level=logging.INFO, format='%(asctime)s - %(levelname)s - %(message)s')

In [3]:
# Prometheus metrics server
start_http_server(8000)

In [4]:
# Define monitoring metrics
etl_duration = Gauge('duration_sec', 'Time taken for ETL process')
data_loaded = Gauge('loaded_rows', 'Number of rows loaded into database')

In [5]:
# Database connection setup
# Replace 'your_password' with the correct password for the root user
DATABASE_URI = 'mysql+pymysql://root:your_password@localhost/ADS_507_sports'
engine = sqlalchemy.create_engine(DATABASE_URI)

start_time = time.time()

## Import datasets

In [6]:
try:
    logging.info("Importing CSV files...")
    expenses_df = pd.read_csv('Expenses.csv')
    revenue_df = pd.read_csv('Revenue.csv')
    coaching_staff_df = pd.read_csv('Coaching_Staff.csv')
    logging.info("CSV files imported successfully.")
except Exception as e:
    logging.error(f"Error importing CSV files: {e}")
    raise

2025-02-24 10:56:12,425 - INFO - Importing CSV files...
2025-02-24 10:56:12,472 - INFO - CSV files imported successfully.

## Data Exploration and Pre-processing

In [7]:
logging.info("Inspecting expenses data...")
expenses_df.head(3)

2025-02-24 10:56:12,476 - INFO - Inspecting expenses data...

,Survey Year,UNITID,OPE ID,Institution Name,State CD,Male Undergraduates,Female Undergraduates,Total Undergraduates,Baseball Total Expenses,Basketball Total Expenses,All Track Combined Total Expenses,Football Total Expenses,Golf Total Expenses,Gymnastics Total Expenses,Soccer Total Expenses,Softball Total Expenses,Tennis Total Expenses,Volleyball Total Expenses,Grand Total Expenses
0,2003,100654,100200,Alabama A & M University,AL,2362,2584,4946,222504.0,1092504,296168.0,1913709.0,60846.0,NaN,407384.0,182237.0,119255.0,262891.0,6738484
1,2003,100724,100500,Alabama State University,AL,1772,2482,4254,152444.0,1127382,139102.0,1793923.0,101943.0,NaN,NaN,134663.0,120539.0,130397.0,4163344
2,2003,175342,239600,Alcorn State University,MS,952,1406,2358,132373.0,528424,321974.0,857105.0,81516.0,NaN,73828.0,141603.0,89680.0,98879.0,2886975

In [8]:
logging.info("Inspecting revenue data...")
revenue_df.head(3)

2025-02-24 10:56:12,487 - INFO - Inspecting revenue data...

,Survey Year,UNITID,OPE ID,Institution Name,State CD,Male Undergraduates,Female Undergraduates,Total Undergraduates,Baseball Total Revenue,Basketball Total Revenue,All Track Combined Total Revenue,Football Total Revenue,Golf Total Revenue,Gymnastics Total Revenue,Soccer Total Revenue,Softball Total Revenue,Tennis Total Revenue,Volleyball Total Revenue,Grand Total Revenue
0,2003,100654,100200,Alabama A & M University,AL,2362,2584,4946,222503.0,1230648,296167.0,2475828.0,60847.0,NaN,409882.0,182238.0,119256.0,260491.0,8521205
1,2003,100724,100500,Alabama State University,AL,1772,2482,4254,136998.0,1035692,105654.0,2025850.0,118442.0,NaN,NaN,146215.0,100389.0,131968.0,3860658
2,2003,175342,239600,Alcorn State University,MS,952,1406,2358,4799.0,74917,11656.0,244346.0,2728.0,NaN,2976.0,3968.0,3720.0,3224.0,2538138

In [9]:
logging.info("Inspecting coaching staff data...")
coaching_staff_df.head(3)

2025-02-24 10:56:12,499 - INFO - Inspecting coaching staff data...

,Survey Year,UNITID,OPE ID,Institution Name,State CD,Male Undergraduates,Female Undergraduates,Total Undergraduates,Men's Team Average Annual Institutional Salary per Head Coach,Men's Team Number of Head Coaches Included in Average,Women's Team Average Annual Institutional Salary per Head Coach,Women's Team Number of Head Coaches Included in Average
0,2003,100654,100200,Alabama A & M University,AL,1936,2856,4792,52248,7,43763,6
1,2003,100724,100500,Alabama State University,AL,1095,1947,3042,354473,5,21064,7
2,2003,175342,239600,Alcorn State University,MS,690,1327,2017,27395,6,21510,7

In [10]:
# Remove unneccesary columns
logging.info("Cleaning and transforming data...")
expenses_df = expenses_df.drop(['Total Undergraduates', 'Baseball Total Expenses', 'All Track Combined Total Expenses', 'Golf Total Expenses', 'Gymnastics Total Expenses', 'Softball Total Expenses', 'Tennis Total Expenses', 'Volleyball Total Expenses'], axis=1)
revenue_df = revenue_df.drop(['Total Undergraduates', 'Baseball Total Revenue', 'All Track Combined Total Revenue', 'Golf Total Revenue', 'Gymnastics Total Revenue', 'Softball Total Revenue', 'Tennis Total Revenue', 'Volleyball Total Revenue'], axis=1)
coaching_staff_df = coaching_staff_df.drop(['Total Undergraduates'], axis=1)

2025-02-24 10:56:12,506 - INFO - Cleaning and transforming data...

In [11]:
# Column data types
logging.info("Inspecting datatypes...")
print("Expenses:\n", expenses_df.dtypes)
print("\nRevenue:\n", revenue_df.dtypes)
print("\nCoaching Staff:\n", coaching_staff_df.dtypes)

2025-02-24 10:56:12,513 - INFO - Inspecting datatypes...

Expenses:
 Survey Year                    int64
UNITID                         int64
OPE ID                         int64
Institution Name              object
State CD                      object
Male Undergraduates            int64
Female Undergraduates          int64
Basketball Total Expenses      int64
Football Total Expenses      float64
Soccer Total Expenses        float64
Grand Total Expenses           int64
dtype: object

Revenue:
 Survey Year                   int64
UNITID                        int64
OPE ID                        int64
Institution Name             object
State CD                     object
Male Undergraduates           int64
Female Undergraduates         int64
Basketball Total Revenue      int64
Football Total Revenue      float64
Soccer Total Revenue        float64
Grand Total Revenue           int64
dtype: object

Coaching Staff:
 Survey Year                                                          int64
UNITID                                                               int64
OPE ID                                                               int64
Institution Name                                                    object
State CD                                                            object
Male Undergraduates                                                  int64
Female Undergraduates                                                int64
Men's Team Average Annual Institutional Salary per Head Coach        int64
Men's Team Number of Head Coaches Included in Average                int64
 Women's Team Average Annual Institutional Salary per Head Coach     int64
Women's Team Number of Head Coaches Included in Average              int64
dtype: object

In [12]:
# Missing values
logging.info("Inspecting missing data...")
print("Expenses:\n", expenses_df.isnull().sum())
print("\nRevenue:\n", revenue_df.isnull().sum())
print("\nCoaching Staff:\n", coaching_staff_df.isnull().sum())

2025-02-24 10:56:12,518 - INFO - Inspecting missing data...

Expenses:
 Survey Year                    0
UNITID                         0
OPE ID                         0
Institution Name               0
State CD                       0
Male Undergraduates            0
Female Undergraduates          0
Basketball Total Expenses      0
Football Total Expenses       63
Soccer Total Expenses        236
Grand Total Expenses           0
dtype: int64

Revenue:
 Survey Year                   0
UNITID                        0
OPE ID                        0
Institution Name              0
State CD                      0
Male Undergraduates           0
Female Undergraduates         0
Basketball Total Revenue      0
Football Total Revenue       63
Soccer Total Revenue        243
Grand Total Revenue           0
dtype: int64

Coaching Staff:
 Survey Year                                                         0
UNITID                                                              0
OPE ID                                                              0
Institution Name                                                    0
State CD                                                            0
Male Undergraduates                                                 0
Female Undergraduates                                               0
Men's Team Average Annual Institutional Salary per Head Coach       0
Men's Team Number of Head Coaches Included in Average               0
 Women's Team Average Annual Institutional Salary per Head Coach    0
Women's Team Number of Head Coaches Included in Average             0
dtype: int64

In [13]:
# Check for duplicate rows
logging.info("Inspecting duplicate data...")
print("Expenses:\n", expenses_df.duplicated().sum())
print("\nRevenue:\n", revenue_df.duplicated().sum())
print("\nCoaching Staff:\n", coaching_staff_df.duplicated().sum())

2025-02-24 10:56:12,525 - INFO - Inspecting duplicate data...

Expenses:
 0

Revenue:
 0

Coaching Staff:
 0

## Transformations

In [14]:
# Rename columns for index clarity and readibility
logging.info("Cleaning and transforming data...")
expenses_df.rename(columns={'UNITID': 'unit id', 'State CD': 'state'}, inplace=True)
revenue_df.rename(columns={'UNITID': 'unit id', 'State CD': 'state'}, inplace=True)
coaching_staff_df.rename(columns={"UNITID": "unit id",
                                  "State CD": "state",
                                  "Men's Team Average Annual Institutional Salary per Head Coach": "m team avg coach salary", 
                                  "Men's Team Number of Head Coaches Included in Average": "m team coach count",
                                  " Women's Team Average Annual Institutional Salary per Head Coach": "w team avg coach salary",
                                  "Women's Team Number of Head Coaches Included in Average": "w team coach count"},
                                  inplace=True)

2025-02-24 10:56:12,534 - INFO - Cleaning and transforming data...

In [15]:
# Convert data types
# expenses_df['Institution Name'] = expenses_df['Institution Name'].astype(str)
# expenses_df['State CD'] = expenses_df['State CD'].astype(str)
# revenue_df['Institution Name'] = revenue_df['Institution Name'].astype(str)
# revenue_df['State CD'] = revenue_df['State CD'].astype(str)
# coaching_staff_df['Institution Name'] = coaching_staff_df['Institution Name'].astype(str)

In [16]:
# Column name cleanup
logging.info("Cleaning and transforming data...")
expenses_df.columns = expenses_df.columns.str.lower().str.replace(" ", "_")
revenue_df.columns = revenue_df.columns.str.lower().str.replace(" ", "_")
coaching_staff_df.columns = coaching_staff_df.columns.str.lower().str.replace(" ", "_")

2025-02-24 10:56:12,567 - INFO - Cleaning and transforming data...

In [17]:
# Fill missing values rows
logging.info("Cleaning and transforming data...")
expenses_df.fillna(0, inplace=True)
revenue_df.fillna(0, inplace=True)

2025-02-24 10:56:12,578 - INFO - Cleaning and transforming data...

## View cleaned datasets

In [18]:
expenses_df.head(3)

,survey_year,unit_id,ope_id,institution_name,state,male_undergraduates,female_undergraduates,basketball_total_expenses,football_total_expenses,soccer_total_expenses,grand_total_expenses
0,2003,100654,100200,Alabama A & M University,AL,2362,2584,1092504,1913709.0,407384.0,6738484
1,2003,100724,100500,Alabama State University,AL,1772,2482,1127382,1793923.0,0.0,4163344
2,2003,175342,239600,Alcorn State University,MS,952,1406,528424,857105.0,73828.0,2886975

In [19]:
revenue_df.head(3)

,survey_year,unit_id,ope_id,institution_name,state,male_undergraduates,female_undergraduates,basketball_total_revenue,football_total_revenue,soccer_total_revenue,grand_total_revenue
0,2003,100654,100200,Alabama A & M University,AL,2362,2584,1230648,2475828.0,409882.0,8521205
1,2003,100724,100500,Alabama State University,AL,1772,2482,1035692,2025850.0,0.0,3860658
2,2003,175342,239600,Alcorn State University,MS,952,1406,74917,244346.0,2976.0,2538138

In [20]:
coaching_staff_df.head(3)

,survey_year,unit_id,ope_id,institution_name,state,male_undergraduates,female_undergraduates,m_team_avg_coach_salary,m_team_coach_count,w_team_avg_coach_salary,w_team_coach_count
0,2003,100654,100200,Alabama A & M University,AL,1936,2856,52248,7,43763,6
1,2003,100724,100500,Alabama State University,AL,1095,1947,354473,5,21064,7
2,2003,175342,239600,Alcorn State University,MS,690,1327,27395,6,21510,7

## Connect to MySQL Server

In [21]:
# Login to MySQL 
# Replace 'YourUsername' and 'YourPassword' with the correct password for the root user
userName = 'YourUsername'
userPass = 'YourPassword'
conn = mysql.Connect(
    host = 'localhost', 
    port = int(3306), 
    user = userName, 
    passwd = userPass, 
)

### Create Sports Database and tables

In [22]:
conn.cursor().execute("CREATE DATABASE IF NOT EXISTS ADS_507_sports")

# Open to Sports database
conn.select_db("ADS_507_sports")

### Load dataframes into MySQL tables

In [23]:
# Load expense data to database
try:
    logging.info("Loading transformed data into database...")
    expenses_df.to_sql('expenses', con=engine, if_exists='replace', index=False)
    data_loaded.set(len(expenses_df))
    logging.info("Data loaded successfully.")
except Exception as e:
    logging.error(f"Error loading data into database: {e}")
    raise

2025-02-24 10:56:12,613 - INFO - Loading transformed data into database...
2025-02-24 10:56:12,727 - INFO - Data loaded successfully.

In [24]:
# Load revenue data to database
try:
    logging.info("Loading transformed data into database...")
    revenue_df.to_sql('revenue', con=engine, if_exists='replace', index=False)
    data_loaded.set(len(revenue_df))
    logging.info("Data loaded successfully.")
except Exception as e:
    logging.error(f"Error loading data into database: {e}")
    raise

2025-02-24 10:56:12,732 - INFO - Loading transformed data into database...
2025-02-24 10:56:12,847 - INFO - Data loaded successfully.

In [25]:
# Load coaching_staff data to database
try:
    logging.info("Loading transformed data into database...")
    coaching_staff_df.to_sql('coaching_staff', con=engine, if_exists='replace', index=False)
    data_loaded.set(len(coaching_staff_df))
    logging.info("Data loaded successfully.")
except Exception as e:
    logging.error(f"Error loading data into database: {e}")
    raise

2025-02-24 10:56:12,851 - INFO - Loading transformed data into database...
2025-02-24 10:56:12,954 - INFO - Data loaded successfully.

### Create Net Profit Table in SQL

In [26]:
# SQL transformation to create net profit table
create_net_profit_table = """
    CREATE TABLE net_profit AS
    SELECT
    r.survey_year,
    r.unit_id,
    r.ope_id,
    r.institution_name,
    r.state,
    (r.basketball_total_revenue - e.basketball_total_expenses) AS profit,
    (c.m_team_avg_coach_salary + c.w_team_avg_coach_salary) AS total_coach_salary,
    (r.basketball_total_revenue - e.basketball_total_expenses - (c.m_team_avg_coach_salary + c.w_team_avg_coach_salary)) AS profit_coaching
    FROM
        revenue r
    JOIN
        expenses e ON r.unit_id = e.unit_id AND r.ope_id = e.ope_id
    JOIN
        coaching_staff c ON r.unit_id = c.unit_id AND r.ope_id = c.ope_id
    ORDER BY
        r.survey_year, r.unit_id, r.ope_id;
"""

conn.cursor().execute(create_net_profit_table)

1491257

### ETL duration

In [27]:
# Capture ETL duration
etl_duration.set(time.time() - start_time)
logging.info("ETL pipeline execution completed successfully.")

2025-02-24 10:56:17,408 - INFO - ETL pipeline execution completed successfully.